at-dongvd/DAC_Waveform_STM32L4/STM32L4_DAC_8bit_12bit/STM32L4_Lab_Template_C/LED_C/main.c
#include "stm32l476xx.h"
#include <stdint.h>
#include <math.h>

#define radian_per_degree              0.0174532925
int main(void){
  unsigned int i, output;
	signed int temp = 0;
  // Enable the clock to GPIO Port A	
  RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;   

	RCC->APB1ENR1 |= RCC_APB1ENR1_DAC1EN;
	
	GPIOA->MODER &= ~(0x0F<<(2*4));
	GPIOA->MODER |= 0x0F<<(2*4);
	
	DAC->CR |= DAC_CR_TEN1 | DAC_CR_TEN2;
	DAC->CR |= DAC_CR_TSEL1 | DAC_CR_TSEL2;
	DAC->CR |= DAC_CR_EN1 | DAC_CR_EN2;
	
	output = 0;
	
  // Dead loop & program hangs here
	while(1)
     {
			 DAC->DHR12R1 = output;
			 DAC->DHR12R2 = output;
         for(temp = 0; temp < 4096; temp++)
         {
             DAC->DHR12R1 = temp;
             if((temp > 0) && (temp < 256))
             {
                 DAC->DHR8R2 = temp;
             }
						 DAC->SWTRIGR |= DAC_SWTRIGR_SWTRIG1 | DAC_SWTRIGR_SWTRIG2;
             for(i=0;i<=10;i++);
         }
         
         for(temp = 4095; temp > -1; temp--)
         {
             DAC->DHR12R1 = temp;
             if((temp > 0) && (temp < 256))
             {
                 DAC->DHR8R2 = temp;
             }
						 DAC->SWTRIGR |= DAC_SWTRIGR_SWTRIG1 | DAC_SWTRIGR_SWTRIG2;
             for(i=0;i<=10;i++);
         }
     };
}
